Revit 2026 API

# UIApplicationCreateAddInCommandBinding Method

---

Creates a new AddInCommandBinding.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AddInCommandBinding CreateAddInCommandBinding(
	RevitCommandId revitCommandId
)
```
```vb
Public Function CreateAddInCommandBinding (
	revitCommandId As RevitCommandId
) As AddInCommandBinding
```
```cpp
public:
AddInCommandBinding^ CreateAddInCommandBinding(
	RevitCommandId^ revitCommandId
)
```
```fsharp
member CreateAddInCommandBinding :
        revitCommandId : RevitCommandId -> AddInCommandBinding
```

#### Parameters

revitCommandId RevitCommandId
    The Revit command id to identify the command handler you want to replace.

#### Return Value

AddInCommandBinding

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when uiApplication or revitCommandId is . |
| InvalidOperationException | Thrown when the given command already has been bound. |

#### Reference

UIApplication Class

Autodesk.Revit.UI Namespace